OdGeCurve3d.convertTo2d(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns pointer to 2d variant of the curve (z-coordinate will be ignored).
\param tol [in]  Tolerance used in case of interpolation.
\param sameParametrization [in]  Necessity of parametrization preserving during conversion.
\remarks
If it is possible, then curve will be converted analytically (i.e. 3d line segment becomes 2d line segment, etc), otherwise it will be projected onto XY-plane.

OdGeCurve3d.appendSamplePoints(OdGeInterval!System.Runtime.CompilerServices.IsConst*,System.Double,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*)
\details
Appends sample points along this curve and their parameter values to the specified arrays.
\param paramInterval [in]  Pointer to the parametric interval.
\param approxEps [in]  Approximate spacing along a curve.
\param pointArray [out]  Receives an array of sample points.
\param pParamArray [out]  Receives an array of parameters at each point.
\remarks
If paramInterval is null, the current curve interval will be used.

OdGeCurve3d.appendSamplePoints(System.Int32,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*)
\details
Appends sample points along this curve and their parameter values to the specified arrays.
\param numSample [in]  Number of samples.
\param pointArray [out]  Receives an array of sample points.
\param pParamArray [out]  Receives an array of parameters at each point.

OdGeCurve3d.getSamplePoints(OdGeInterval!System.Runtime.CompilerServices.IsConst*,System.Double,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*)
\details
Returns sample points along this curve and their parameter values in the specified arrays.
Not implemented for third-party use only.
\param paramInterval [in]  Pointer to the parametric interval.
\remarks
If paramInterval is null, the current curve interval will be used.

OdGeCurve3d.getSamplePoints(System.Double,System.Double,System.Double,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*)
\details
Returns sample points along this curve and their parameter values in the specified arrays.
Not implemented for third-party use only.

OdGeCurve3d.op_Assign(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details The assignment operator for the OdGeCurve3d class.
\param curve [in]  Input 3D curve.
\remarks
Assigns input 3D curve to this curve.

OdGeCurve3d.getSamplePoints(System.Int32,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns sample points along this curve and their parameter values in the specified arrays.
\param numSample [in]  Number of samples.
\param pointArray [out]  Receives an array of sample points.
\param paramArray [out]  Receives an array of parameters at each point.

OdGeCurve3d.getSamplePoints(System.Int32,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns sample points along this curve and their parameter values in the specified arrays.
\param numSample [in]  Number of samples.
\param pointArray [out]  Receives an array of sample points.

OdGeCurve3d.getSamplePoints(System.Double,System.Double,System.Double,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns sample points along this curve and their parameter values in the specified arrays.
\param fromParam [in]  Starting parameter value.
\param toParam [in]  Ending parameter value.
\param approxEps [in]  Approximate spacing along a curve.
\param pointArray [out]  Receives an array of sample points.
\param paramArray [out]  Receives an array of parameters at each point.
\param forceResampling [in]  sample points are forced to be regenerated.

OdGeCurve3d.evalPoint(System.Double,System.Int32,OdArray&lt;OdGeVector3d,OdMemoryAllocator&lt;OdGeVector3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve corresponding to the specified parameter value,
and the derivatives at that point.
\param param [in]  Parameter to be evaluated.
\param numDeriv [in]  Number of derivatives to be computed.
\param derivatives [out]  Receives an array of derivatives at the point corresponding to param.

OdGeCurve3d.evalPoint(System.Double)
\details
Returns the point on this curve corresponding to the specified parameter value.
\param param [in]  Parameter to be evaluated.

OdGeCurve3d.midPoint(System.Double)
\details
Calculates a point from the curve interval that corresponds to the specified coefficient.
\param coef [in] Coefficient from the interval [0; 1].
\returns Point from the curve interval that corresponds to the coefficient parameter.
\remarks
The value of the coef variable must be within [0; 1], where
* 0 is the beginning of the curve interval,
* 0.5 is the middle of the curve interval,
* 1 is the end of the curve interval.
Otherwise, an exception eNotApplicable will be thrown.
\remarks
The curve must have a bounded interval otherwise, an exception
eCurveEndsMissed will be thrown.

OdGeCurve3d.hasMidPoint(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Checks the boundaries of the curve interval and calculates a point from the curve interval that corresponds to the specified coefficient.
\param point [out] Receives the point from the curve interval that corresponds to the coefficient.
\param coef   [in] Coefficient from the interval [0; 1].
\returns true if and only if the parametric interval of the curve is
bounded and the value of the coef variable lies within [0; 1].
\remarks
The value of the coef variable must be within [0; 1], where
* 0 is the beginning of the curve interval,
* 0.5 is the middle of the curve interval,
* 1 is the end of the curve interval.

OdGeCurve3d.hasEndPoint(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true, and the end point,  if and only if the parametric interval of this curve has an upper bound.
\param endPoint [out]  Receives the end point.

OdGeCurve3d.hasStartPoint(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true, and the start point, if and only if the parametric interval of this curve has a lower bound.
\param startPoint [out]  Receives the start point.

OdGeCurve3d.getLocalClosestPoints(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve locally closest to the specified curve,
and the point on the other curve locally closest to this curve.
\param curve [in]  Any 3D curve.
\param approxPntOnThisCrv [in/out] Approximate point on this curve.
\param approxPntOnOtherCrv [in/out] Approximate point on other curve.
\param pInterval1 [in] Pointer to the interval in which the point on this curve must lie.
\param pInterval2 [in] Pointer to the interval in which the point on the other curve must lie.
\param tol [in] Geometric tolerance.

OdGeCurve3d.getLocalClosestPoints(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve locally closest to the specified point.
\param point [in]  Any 3D point.
\param approxPntOnThisCrv [in/out] Approximate point on this curve.
\param pInterval1 [in] Pointer to the interval in which the point on this curve must lie.
\param tol [in] Geometric tolerance.

OdGeCurve3d.explode(OdArray&lt;OdSharedPtr&lt;OdGeCurve3d&gt;,OdObjectsAllocator&lt;OdSharedPtr&lt;OdGeCurve3d&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Int32,OdMemoryAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*)
\details
Explodes this curve over the specified interval.
\param explodedCurves [out]  Receives an array of pointers to the subcurves from the explosion.
\param newExplodedCurves [out]  Receives an array of flags which, if true, correspond to those explodedCurves the caller must delete.
\param pInterval [in]  Pointer to the interval to be exploded. Defaults to entire curve.
\remarks
The original curve is not changed.

OdGeCurve3d.getSplitCurves(System.Double,OdGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns pointers to the two curves that result from splitting this curve at the point corresponding
to param.
\param param [in]  The parameter value corresponding to the split point.
\param piece1 [out]  Receives a pointer to the first curve.
\param piece2 [out]  Receives a pointer to the second curve.
\remarks
If param corresponds to a point not on this curve,
or to the start point or end point of this curve,
piece1 and piece2 are set to NULL.
The curves pointed to by piece1 and piece2
are created with the new command, and must be deleted by the caller.

OdGeCurve3d.isDegenerate(OdGeEntity3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this curve degenerates, and returns
the entity to which this curve degenerates.
\param pConvertedEntity [out]  Receives a pointer to the object to which this curve degenerates.
\param tol [in]  Geometric tolerance.
\remarks
If isDegenerate returns true, the returned object was created with the new operator, and it is the responsibility of the caller to delete it.

OdGeCurve3d.isDegenerate(OdGe.EntityId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this curve degenerates, and returns
the type of entity to which this curve degenerates.
\param degenerateType [out]  Receives the type of curve to which this curve degenerates.
\param tol [in]  Geometric tolerance.
\remarks
If isDegenerate returns true, the returned object was created with the new operator, and it is the responsibility of the caller to delete it.

OdGeCurve3d.area(System.Double,System.Double,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determines the area of this curve between the specified parameters.
Returns true (and a value) if and only if this curve is planar.
\param startParam [in]  Starting parameter value.
\param endParam [in]  Ending parameter value.
\param value [out]  Receives the area.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.paramAtLength(System.Double,System.Double,System.Boolean,System.Double)
\details
Returns the parameter of the point a specified distance
from the starting point corresponding to datumParam.
\param datumParam [in]  Parameter corresponding to the start point.
\param length [in]  Distance along curve from the start point.
\param posParamDir [in]  True if and only if returned parameter is to be greater than dataParam.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.length(System.Double,System.Double,System.Double)
\details
Returns the length of this curve over the specified parameter range.
\param fromParam [in]  Starting parameter value.
\param toParam [in]  Ending parameter value.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.isCoplanarWith(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns True if the specified curve entity is coplanar with
this curve and returns the common plane.
\param curve [in]  Any 3D curve.
\param plane [out]  Receives the plane of the curves.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.isLinear(OdGeLine3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true, and a linear entity coincident with this curve,
if and only if this curve is linear.
\param line [out]  Receives the line coincident with this curve.
\param tol [in]  Geometric tolerance.
\remarks
An infinite line is returned, even if this curve is bounded.
\remarks
As implemented, this function does nothing but
return false.
It will be fully implemented in a future release.

OdGeCurve3d.isPlanar(OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this curve is planar, and returns
the plane of this curve.
\param plane [out]  Receives the plane of this curve.
\param tol [in]  Geometric tolerance.
\remarks
Lines are considered planar the returned plane is an
arbitrary plane containing the line.

OdGeCurve3d.isClosed(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this curve is closed within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.getTrimmedOffset(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdSharedPtr&lt;OdGeCurve3d&gt;,OdObjectsAllocator&lt;OdSharedPtr&lt;OdGeCurve3d&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.OffsetCrvExtType,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns one or more trimmed offset curves.
\param distance [in]  Offset distance.
\param planeNormal [in]  A normal to the plane of this curve.
\param offsetCurveList [out]  Receives an array of trimmed offset curves.
\param extensionType [in]  How curves will be extended at discontinuities of type C1.
\param tol [in]  Geometric tolerance.
\remarks
The offsets are trimmed to eliminate self-intersecting loops.
The curve is assumed to be planar, and planeNomal is assumed to be
normal to the curve plane.
the direction of positive offset at any point on this curve
is the cross product of planeNormal and the tangent to the
curve at that point.
The new operator is used to create the curves returned by
offsetCurveList. It is up to the caller to delete these curves.
\remarks
Currently not implemented.
Throws:
Exception
eNotImplemented

OdGeCurve3d.paramOf(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parameter value of a point.
\param point [in]  Point to be evaluated.
\param range [in]  Interval on curve.
\param tol [in]  Geometric tolerance.
\remarks
The returned parameters specify a point within tol of point.
If point is not on this curve, end or start of interval will be setted.
In case of uvBox == NULL paramOf(point, rng, tol) is called in which rng - native range of curve.
If you are not sure the point is on this curve, use
isOn () instead of this function.

OdGeCurve3d.paramOf(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parameter value of a point.
\param point [in]  Point to be evaluated.
\param tol [in]  Geometric tolerance.
\remarks
The returned parameters specify a point within tol of point.
If point is not on this curve, the results are unpredictable.
If you are not sure the point is on this curve, use
isOn () instead of this function.
\remarks
If projection of the point does not lie in range-interval, the closest bound of the interval is returned.
In case of uvBox == NULL paramOf(point, tol) is called.

OdGeCurve3d.isOn(System.Double,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determines if an input parameter value is within a valid parametric range of the curve.
\param param    [in]  Input parameter value.
\param tol      [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.isOn(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determines if a point lies on a curve.
\param point [in]  Input point.
\param param [out]  Output parameter value of point if the point lies on the curve.
\param tol   [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.orthoProject(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the entity that is the orthogonal projection of the curve onto the projection plane.
\param projectionPlane  [in]  Plane on which the curve is to be projected.
\param tol              [in]  Geometric tolerance.
\remarks
The returned entity can be a different type than the original curve and can even not be a curve.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.project(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the entity that is the projection of the curve onto the projection plane in the specified direction.
\param projectionPlane  [in]  Plane on which the curve is to be projected.
\param projectDirection [in]  Direction in which the curve is to be projected.
\param tol              [in]  Geometric tolerance.
\remarks
The projectDirection vector must not be parallel to the projection plane.
\remarks
The returned entity can be a different type than the original curve and can even not be a curve.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.getGeomExtents(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*)
\details
Returns bounding box of the whole curve or a part of it.
The box is axis-aligned in the specified local coordinate system.
It is guaranteed to enclose the curve, but not guaranteed to be tight/minimal.
\param range [in]  The part of the curve to be bounded.
\param coordSystem [in]  The local coordinate system in which box extents are computed.
\remarks
If range is unbounded (e.g. by default), then bounding box of the whole curve (which range can be
obtained by getInterval method) is computed. Otherwise bounding box is computed only for the set of
points with parameter in the specified range.
If coordSystem is NULL (e.g. by default), then bounding box is aligned with global coordinate axes.
Otherwise, the box will be axis-aligned in the local coordinate system specified by coordSystem matrix.

OdGeCurve3d.orthoBoundBlock
\details
Returns the bounding box whose edges are aligned with the coordinate axes.
\param range [in]  Interval of this curve to be bounded.

OdGeCurve3d.boundBlock(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the oriented bounding box of curve.
\param range [in]  Sub-interval of this curve to be bounded.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.boundBlock
\details
Returns the oriented bounding box of curve.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.getNormalPoint(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true, and the point on this curve whose normal vector passes through the specified point,
if and only if a normal point was found.
\param point [in]  Any 3D point.
\param pntOnCrv [out]  Receives the normal point.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.getProjClosestPointTo(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified curve,
and the point on the other curve closest to this curve, when this curve
is projected in the specified direction.
\param curve [in]  Any 3D curve.
\param projectDirection [in]  Projection Direction.
\param pntOnThisCrv [out]  Receives the closest point on this curve.
\param pntOnOtherCrv [out]  Receives the closest point on other curve.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.getProjClosestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point when this curve
is projected in the specified direction.
\param point [in]  Any 3D point.
\param projectDirection [in]  Projection Direction.
\param pntOnCrv [out]  Receives the closest point on this curve.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.projClosestPointTo(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified curve,
and the point on the other curve closest to this curve, when this curve
is projected in the specified direction.
\param curve [in]  Any 3D curve.
\param projectDirection [in]  Projection Direction.
\param pntOnOtherCrv [out]  Receives the closest point on other curve.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.projClosestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point when this curve
is projected in the specified direction.
\param point [in]  Any 3D point.
\param projectDirection [in]  Projection Direction.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.getClosestPointTo(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified curve,
and the point on the other curve closest to this curve.
\param curve [in]  Any 3D curve.
\param pntOnThisCrv [out]  Receives the closest point on this curve.
\param pntOnOtherCrv [out]  Receives the closest point on other curve.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.getClosestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point.
\param point [in]  Any 3D point.
\param pntOnCrv [out]  Receives the closest point on this curve.
\param tol [in]  Geometric tolerance.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.closestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point.
\param point [in]  Any 3D point.
\param param [out]  uv-coord of closest point.
\param range [in]  interval of closest point.
\param tol [in]  Geometric tolerance.
\remarks
Native interval is not considered.
If projection of the point does not lie in range-interval, the closest bound of the interval is returned.
In case of uvBox == NULL closestPointTo(point, range, tol) is called where range is a native curves interval.
An unbounded interval should not be used here.

OdGeCurve3d.closestPointTo(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified curve, and the point
on the other curve closest to this curve.
\param curve [in]  Any 3D curve.
\param pntOnOtherCrv [out]  Receives the closest point on other curve.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.closestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point.
\param point [in]  Any 3D point.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.distanceTo(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the distance to the point on this curve closest to the specified curve.
\param curve [in]  Any 3D curve.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.distanceTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the distance to the point on this curve closest to the specified point.
\param point [in]  Any 3D point.
\param tol [in]  Geometric tolerance.

OdGeCurve3d.setInterval
\details
Sets the parametric interval of this curve.
\param interval [in]  Parametric interval of this curve
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.reverseParam
\details
Reverses the parameter direction this curve.
\remarks
The point set of this curve is unchanged.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.
Throws:
Exception
eNotImplemented

OdGeCurve3d.getInterval(OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parametric interval of this curve.
\param interval [out]  Receives the parametric interval of this curve.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.

OdGeCurve3d.getInterval(OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parametric interval of this curve.
\param interval [out]  Receives the parametric interval of this curve.
\remarks
By default this function throws the exception "not Implemented". Should be implemented in derived classes.